BusinessProcesses/СогласованиеПлатежейПредставительств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<BusinessProcess>
		<Properties>
			<Name>СогласованиеПлатежейПредставительств</Name>
			<Task>Task.ЗадачаИсполнителяПоСогласованиюПлатежей</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗаявкаПрошлаСогласованиеРук</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаПрошлаСогласованиеКурирующимЧП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаПрошлаСогласованиеСогласующим</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверкаНаПолнотуСведенийВыполнена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЦС_СостоянияСогласованияПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетнаяДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормируемыйБюджет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_Бюджеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурирующийЧП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДиректорСТП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласующий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаВключенаВРеестр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаПрошлаСогласованиеРуководительФД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РуководительФД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаПрошлаСогласованиеМенеджераФД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КомментарииПроцесса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасчетнаяТаблица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодСтрокиБюджета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяБюджета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_СтатьиБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГодовойПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отклонение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПоЗаявке</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОдобреннаяСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактПредыдущегоПериода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммыПредыдущихПлатежей</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокПланаСУчетомФакта</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаДокумента</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПоступления</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОплаченоПоДоговору</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДоговора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОперации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыОпераций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДвиженияДенежныхСредств</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКонтрагента</Name>
							<Comment>(Общ) Банковский счет контрагента</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭСФ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЭСФ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

InformationRegisters/ЦС_АдресацияБизнесПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЦС_АдресацияБизнесПроцессов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦС_ПодразделенияДляБП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/б_СоответствияСтатейБюджетаСчетамБУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>б_СоответствияСтатейБюджетаСчетамБУ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПризнакСуммы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтатьяБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_СтатьиБюджета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыДополнительнойИнформацииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыДополнительнойИнформацииОбъектов</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Файл</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изображение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

BusinessProcesses/СогласованиеПлатежейПредставительств/Forms/ФормаБизнесПроцесса/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОбновитьКарту(Команда) // Обработчик команды формы 
	ОбновитьКартуСервер();  	
КонецПроцедуры  

&НаСервере
Процедура ОбновитьКартуСервер() // Серверная контекстная процедура получения карты маршрута 
	// Конвертируем объект формы в объект бизнес-процесса
	ОбъектБП = РеквизитФормыВЗначение("Объект"); 
	// Вызываем метод получения карты маршрута текущего бизнес-процесса
	Карта = ОбъектБП.ПолучитьКартуМаршрута();      	
КонецПроцедуры

&НаСервере
Процедура ПолучитьТекущееСостояниеБП()
	ОбновитьКартуСервер();
	Если не ЗначениеЗаполнено(ТекущаяТочка) тогда		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачаИсполнителя.ТочкаМаршрута,
		|	ЗадачаИсполнителя.Ссылка
		|ИЗ
		|	Задача.ЗадачаИсполнителяПоСогласованиюПлатежей КАК ЗадачаИсполнителя
		|ГДЕ
		|	ЗадачаИсполнителя.БизнесПроцесс = &Ссылка
		|	И НЕ ЗадачаИсполнителя.Выполнена";
		
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		
		Результат = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ТекущаяТочка 	= ВыборкаДетальныеЗаписи.точкамаршрута;
			Задача 			= ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
			
	Если параметры.Свойство("Задача") тогда
		Задача 			= Параметры.Задача;
		ТекущаяТочка 	= Параметры.Задача.ТочкаМаршрута;	
	КонецЕсли;
	Если Параметры.Ключ.Пустая() тогда
		ПолучитьТекущееСостояниеБП();
		ПодготовитьФорму(ЭтаФорма);
	КонецЕсли;
			
	ТекущийИсполнитель = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры

Процедура ОбновитьИсториюИзменений()
	
	ИсторияИсполнения = "";
	Комментарии.Очистить();
	Для Каждого СтрокаТЧ из Объект.КомментарииПроцесса Цикл
		ИсторияИсполнения = ИсторияИсполнения + Символы.ПС +"["+ СтрокаТЧ.Автор +"]"+ " *** " +СтрокаТЧ.Дата + Символы.Таб + СтрокаТЧ.Комментарий+Символы.ПС;	
	КонецЦикла;
	Макет = БизнесПроцессы.СогласованиеПлатежейПредставительств.ПолучитьМакет("Макет");
	Обл = Макет.ПолучитьОбласть("Заголовок");
	Комментарии.Вывести(Обл);
	Обл = Макет.ПолучитьОбласть("Строка");
	
	Для каждого СтрокаТЧ Из объект.КомментарииПроцесса Цикл
		Обл.Параметры.Заполнить(СтрокаТЧ);
		Комментарии.Вывести(Обл);
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПодготовитьФорму(Форма)
	         
	Объект 			= Форма.Объект;
	Элементы 		= Форма.Элементы;	
	ТекущаяТочка 	= Форма.ТекущаяТочка;
	Задача			= Форма.Задача;
	
	Если задача.Выполнена тогда
		Форма.ТолькоПросмотр = Истина;
		Сообщить("Текущий этап выполнен. Редактирование формы невозможно");
		возврат;
	КонецЕсли;
	Если объект.Завершен тогда
		Форма.Элементы.Группа1.Видимость = ложь; 
		Форма.ТолькоПросмотр = Истина;
		Сообщить("Бизнес-процесс завершен. Редактирование формы невозможно");
		возврат;
	КонецЕсли;
	
	Если Объект.стартован 
		и не ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПлатежейПредставительств.ТочкаМаршрута.РаботаСЗаявкойАвтором") Тогда
		элементы.левая.толькопросмотр 		= истина;
		Элементы.правая.Толькопросмотр		= Истина;
				
	КонецЕсли;
	
	Если ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПлатежейПредставительств.ТочкаМаршрута.СогласованиеСРП") 				тогда
		Элементы.ЗаявкаПрошлаСогласованиеРук.Доступность 		= истина;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПлатежейПредставительств.ТочкаМаршрута.СогласованиеСМенеджеромФД")			тогда
		Элементы.ЗаявкаПрошлаСогласованиеКурирующимЧП.Доступность 		= истина;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПлатежейПредставительств.ТочкаМаршрута.СогласованиеСРуководителемФД") Тогда
		Элементы.ЗаявкаПрошлаСогласованиеРуководительФД.Доступность = Истина;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПлатежейПредставительств.ТочкаМаршрута.ПередачаВКазначейство")	тогда
		Элементы.ВыполнитьЭтап.Заголовок = "Ознакомлен";
		Элементы.ВернутьНаДоработку.Видимость = Ложь;
		Элементы.ОтказатьВПоставленнойЗадаче.Видимость = Ложь;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПлатежейПредставительств.ТочкаМаршрута.РаботаСЗаявкойАвтором")
		или не ЗначениеЗаполнено(ТекущаяТочка) тогда
		Элементы.вернутьнадоработку.видимость 				= ложь;
		Элементы.ОтказатьВПоставленнойЗадаче.видимость 		= ложь;
		Элементы.ВыполнитьЭтап.Заголовок = "Выполнено";
	КонецЕсли;
	
	Польз = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЭтап(Команда)
	ОбработатьБП("ОК");
	ОповеститьОбИзменении(ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПлатежейПредставительств.ПустаяСсылка"));
	ОповеститьОбИзменении(ПредопределенноеЗначение("Задача.ЗадачаИсполнителяПоСогласованиюПлатежей.ПустаяСсылка"));
КонецПроцедуры

&НаКлиенте
Процедура ВернутьНаДоработку(Команда)
	ОбработатьБП("Возврат");
КонецПроцедуры

&НаКлиенте
Процедура ОтказатьВПоставленнойЗадаче(Команда)
	ОбработатьБП("Отказ");
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьБП(РезультатВозврата)
	
	Если ЭтотОбъект.Объект.ПометкаУдаления = Истина Тогда
		Сообщить("Данный объект помечен на удаление и не может быть изменен!");
		Возврат;
	КонецЕсли;
	
	//-=-=
	Если Не РольДоступна("axm_ОтключитьКонтрольСоотвествияИсполнителейВСогласованиях")
		И глТекущийПользователь <> ЭтотОбъект.Задача.Пользователь Тогда
		Сообщить("На текущем этапе согласовывать должен " + ЭтотОбъект.Задача.Пользователь + "!");
		Возврат;
	КонецЕсли;
	//-=-=
		
	Если Не ОбработатьЭтап(РезультатВозврата) тогда
		Возврат;
	КонецЕсли;
	
	Если КомментарийИсполнителя <> "" тогда
		НС = Объект.КомментарииПроцесса.Добавить();
		НС.Автор = ТекущийИсполнитель;
		НС.Дата = ТекущаяДата();
		НС.Комментарий = КомментарийИсполнителя ;
		НС.Этап = ТекущаяТочка;
	КонецЕсли;
	
	Если РезультатВозврата = "ОК" Тогда
		СтатусДокумента = "Согласовано"
	ИначеЕсли РезультатВозврата = "Возврат"  Тогда
		СтатусДокумента = "Возвращено"
	ИначеЕсли РезультатВозврата = "Отказ" Тогда
		СтатусДокумента = "Отказано"
	КонецЕсли;
		
	НоваяЗапись = Объект.Подписи.Добавить();
	НоваяЗапись.Дата				= ТекущаяДата();
	НоваяЗапись.Статус			    = СтатусДокумента;
	НоваяЗапись.Автор				= Пользователи.ТекущийПользователь();
	НоваяЗапись.Этап			    = ТекущаяТочка;

	Записать();
	 	
	Если не Задача.Пустая() тогда
		ВыполнитьЗадачу(Задача);
	Иначе
		Стартовать();
	КонецЕсли;
	
	ОповеститьОбИзменении(ПредопределенноеЗначение("Задача.ЗадачаИсполнителяПоСогласованиюПлатежей.ПустаяСсылка"));
	Закрыть();	
	  
КонецПроцедуры

Процедура Стартовать()
	
	БП = РеквизитФормыВЗначение("Объект");
	БП.Старт();
	ЗначениеВРеквизитФормы(БП,"Объект");
	
КонецПроцедуры

&НаКлиенте
Функция ОбработатьЭтап(РезультатВозврата)
	
	Если РезультатВозврата = "ОК" тогда
		ЗначениеВозврата = Истина;
	ИначеЕсли РезультатВозврата = "Возврат" или РезультатВозврата = "Отказ" Тогда
		Если КомментарийИсполнителя = "" тогда
			Предупреждение("Не указана причина в комментарии текущего исполнителя");
			ЗначениеВозврата = Ложь;
		Иначе
			ЗначениеВозврата = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если РезультатВозврата = "ОК" тогда 
		ЗначениеПоля = "Разрешено";
	ИначеЕсли РезультатВозврата = "Возврат" Тогда
		ЗначениеПоля = "Возвращено";
	Иначе
		ЗначениеПоля = "Отказано";
	КонецЕсли;
		
	Если ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПлатежейПредставительств.ТочкаМаршрута.СогласованиеСРП") Тогда
		Объект.ЗаявкаПрошлаСогласованиеРук = ЗначениеПоля;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПлатежейПредставительств.ТочкаМаршрута.СогласованиеСМенеджеромФД")	Тогда
		//Объект.ЗаявкаПрошлаСогласованиеКурирующимЧП = ЗначениеПоля; //-=-=
		//-=-=
		Объект.ЗаявкаПрошлаСогласованиеМенеджераФД = ЗначениеПоля;
		//-=-=
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПлатежейПредставительств.ТочкаМаршрута.СогласованиеСРуководителемФД") Тогда
		Объект.ЗаявкаПрошлаСогласованиеРуководительФД = ЗначениеПоля;
	//-=-=	
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПлатежейПредставительств.ТочкаМаршрута.СогласованиеСКурирующимЧП")	Тогда
		Объект.ЗаявкаПрошлаСогласованиеКурирующимЧП = ЗначениеПоля;
	//-=-=
	КонецЕсли;	
	
	Возврат ЗначениеВозврата;
	 
КонецФункции

&НаСервереБезКонтекста
Функция ВыполнитьЗадачу(Задача)
	
	ЗадачаОбъект = Задача.ПолучитьОбъект();
	ЗадачаОбъект.ВыполнитьЗадачу();
	
КонецФункции

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПолучитьТекущееСостояниеБП();
	ПодготовитьФорму(ЭтаФорма);
	ОбновитьИсториюИзменений();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦС_АдресацияБизнесПроцессов.Пользователь,
	|	ЦС_АдресацияБизнесПроцессов.Подразделение
	|ИЗ
	|	РегистрСведений.ЦС_АдресацияБизнесПроцессов КАК ЦС_АдресацияБизнесПроцессов
	|ГДЕ
	|	ЦС_АдресацияБизнесПроцессов.Пользователь = &глТекущийПользователь";
	
	Запрос.УстановитьПараметр("глТекущийПользователь", Параметрысеанса.Текущийпользователь);	
	
	ТолькоПросмотр								= Истина;
	Элементы.Группа1.Доступность				= Ложь;
	Элементы.ФормаКоманднаяПанель.Доступность	= Ложь;	
	
	Если (Не ТекущийОбъект.стартован)  
		Или Параметрысеанса.ТекущийПользователь = Задача.Пользователь
		Или Запрос.Выполнить().Выгрузить().НайтиСтроки(Новый Структура("Пользователь, Подразделение", параметрысеанса.текущийпользователь, Задача.Подразделение)).Количество() <> 0
		Или РольДоступна("ПолныеПрава") тогда
		
		Если (НЕ ТекущийОбъект.Завершен) Тогда
			
			ТолькоПросмотр = ложь;
			Элементы.Группа1.Доступность = Истина;
			Элементы.ФормаКоманднаяПанель.Доступность = Истина;
		КонецЕсли;
		
	Иначе
		Сообщить("Этап не предусматривает исполнение текущим пользователем. Форма заблокирована");
	КонецЕсли;
	
	//+++ Oleg SmartT. 2021-04-13	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Файлы.Ссылка
		|ИЗ
		|	Справочник.Файлы КАК Файлы
		|ГДЕ
		|	Файлы.ВладелецФайла = &ВладелецФайла
		|	И НЕ Файлы.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ВладелецФайла", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий()  Цикл
		
		ОбъектФайла = Выборка.Ссылка;

		Если ОбъектФайла.ТекущаяВерсияРасширение = "pdf" Тогда
			АдресЛоготипа = ОбъектФайла.ТекущаяВерсияТом.ПолныйПутьWindows+ОбъектФайла.ТекущаяВерсияПутьКФайлу;
		ИначеЕсли ОбъектФайла.ТекущаяВерсияРасширение = "jpg" Тогда
			ЭтаФорма.Элементы.АдресЛоготипа.Вид = ВидПоляФормы.ПолеКартинки;
			АдресЛоготипа = НавигационнаяСсылкаКартинки(ОбъектФайла, УникальныйИдентификатор);
		КонецЕсли;
	
	КонецЦикла;
	//--- Oleg SmartT. 2021-04-13		

КонецПроцедуры

&НаСервереБезКонтекста
Функция НавигационнаяСсылкаКартинки(ФайлКартинки, ИдентификаторФормы)
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат ПрисоединенныеФайлы.ПолучитьДанныеФайлаБИТ(ФайлКартинки, ИдентификаторФормы).СсылкаНаДвоичныеДанныеФайла;
	
КонецФункции

&НаКлиенте
Процедура ДоговорКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//ФормаВыбора = Справочники.ДоговорыКонтрагентов.ПолучитьФормуВыбора(,ЭлементФормы,);

	//// Владельца менять по умолчанию не даем.
	//ФормаВыбора.ПараметрОтборПоВладельцу = Контрагент;

КонецПроцедуры

&НаСервере
Процедура БанковскийСчетКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	ФормаСчета = Справочники.БанковскиеСчета.ПолучитьФормуВыбора(,Элемент);
	              	
	ФормаСчета.Отбор.Владелец.ВидСравнения  = ВидСравнения.Равно;
	ФормаСчета.Отбор.Владелец.Значение      = объект.Контрагент;
	ФормаСчета.Отбор.Владелец.Использование = Истина;
	
	Если не объект.ВалютаДокумента.Пустая() тогда
		ФормаСчета.Отбор.ВалютаДенежныхСредств.Значение	= объект.ВалютаДокумента;
		ФормаСчета.Отбор.ВалютаДенежныхСредств.Использование = Истина;
		ФормаСчета.Отбор.ВалютаДенежныхСредств.ВидСравнения  = ВидСравнения.Равно;
	КонецЕсли;    	
	
	ФормаСчета.РежимВыбора = Истина;
	объект.БанковскийСчетКонтрагента =ФормаСчета.ОткрытьМодально();

КонецПроцедуры

&НаСервере
Процедура БанковскийСчетОрганизацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ФормаСчета = Справочники.БанковскиеСчета.ПолучитьФормуВыбора(,Элемент);
	
	ФормаСчета.Отбор.Владелец.ВидСравнения  = ВидСравнения.Равно;
	ФормаСчета.Отбор.Владелец.Значение      = объект.Организация;
	ФормаСчета.Отбор.Владелец.Использование = Истина;
	ФормаСчета.ЭлементыФормы.СправочникСписок.ИерархическийПросмотр = Ложь;
	
	ФормаСчета.Отбор.Источникфинансирования.ВидСравнения  = ВидСравнения.Равно;
	ФормаСчета.Отбор.Источникфинансирования.Использование = Истина;
	ФормаСчета.отбор.Источникфинансирования.Значение = Объект.источникфинансирования;
	
	Если не объект.ВалютаДокумента.Пустая() тогда
		ФормаСчета.Отбор.ВалютаДенежныхСредств.Значение	= объект.ВалютаДокумента;
		ФормаСчета.Отбор.ВалютаДенежныхСредств.Использование = Истина;
		ФормаСчета.Отбор.ВалютаДенежныхСредств.ВидСравнения  = ВидСравнения.Равно;
	КонецЕсли;    	
	
	ФормаСчета.РежимВыбора = Истина;
	объект.БанковскийСчетОрганизации = ФормаСчета.ОткрытьМодально();
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//Если РольДоступна("СкрытыеПапкиСогласованиеПлатежей") Тогда
	//	ЭтаФорма.Элементы.РуководительСТП.Видимость = Ложь;
	//	ЭтаФорма.Элементы.КурирующийЧП.Видимость = Ложь;
	//	ЭтаФорма.Элементы.ФормируемыйБюджет.Видимость = Ложь;
	//	ЭтаФорма.Элементы.РасчетнаяДатаПлатежа.Видимость = Ложь;
	//	ЭтаФорма.Элементы.Подразделение.Видимость = Ложь;
	//	ЭтаФорма.Элементы.ЗаявкаПрошлаСогласованиеРук.Видимость = Ложь;
	//	ЭтаФорма.Элементы.ЗаявкаПрошлаСогласованиеКурирующимЧП.Видимость = Ложь;
	//	ЭтаФорма.Элементы.РасчетнаяТаблицаКодСтрокиБюджета.Видимость = Ложь;
	//	ЭтаФорма.Элементы.РасчетнаяТаблицаСтатьяБюджета.Видимость = Ложь;
	//	ЭтаФорма.Элементы.РасчетнаяТаблицаВалютаДокумента.Видимость = Ложь;
	//	ЭтаФорма.Элементы.РасчетнаяТаблицаОплаченоПоДоговору.Видимость = Ложь;
	//	ЭтаФорма.Элементы.РасчетнаяТаблицаСуммаДоговора.Видимость = Ложь;
	//	ЭтаФорма.Элементы.РасчетнаяТаблицаГодовойПлан.Видимость = Ложь;
	//	ЭтаФорма.Элементы.РасчетнаяТаблицаФактПредыдущегоПериода.Видимость = Ложь;
	//	ЭтаФорма.Элементы.РасчетнаяТаблицаСуммыПредыдущихПлатежей.Видимость = Ложь;
	//	ЭтаФорма.Элементы.РасчетнаяТаблицаОстатокПланаСУчетомФакта.Видимость = Ложь;
	//	ЭтаФорма.Элементы.СтраницаКарта.Видимость = Ложь;
	//	ЭтаФорма.Элементы.Комментарии1.Видимость = Ложь;

	//КонецЕсли;

	ЭлементОтбора = СписокФайлов.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокФайловВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.СписокФайлов.ТекущаяСтрока;
	
	Если СокрЛП(ТекСтрока.Наименование) = "" Тогда
	 	СтандартнаяОбработка = Истина;
		Сообщить("Введите описание файла");
	Иначе
		СтандартнаяОбработка = Ложь;
		УниверсальныеМеханизмы.ОткрытьФайлы(Элементы.СписокФайлов.ТекущиеДанные, глТекущийПользователь, Элементы.СписокФайлов.ВыделенныеСтроки);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаписьФайла(ПолноеИмяФайла, Каталог)
	
	НовОбъектХранилища = Справочники.ХранилищеДополнительнойИнформации.СоздатьЭлемент();
	НовОбъектХранилища.Хранилище = Новый ХранилищеЗначения(Новый ДвоичныеДанные(ПолноеИмяФайла), Новый СжатиеДанных);
	НовОбъектХранилища.ИмяФайла = Сред(ПолноеИмяФайла, СтрДлина(Каталог) + 1);
	НовОбъектХранилища.ВидДанных = Перечисления.ВидыДополнительнойИнформацииОбъектов.Файл;
	Если Объект.Ссылка.Пустая() Тогда
		Записать();
	КонецЕсли;
	НовОбъектХранилища.Объект = Объект.Ссылка;
	НовОбъектХранилища.Записать();
		
КонецПроцедуры

&НаКлиенте
Процедура СписокФайловПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	Диалог = УниверсальныеМеханизмы.ПолучитьДиалогВыбораФайлов(Ложь);
		
	Если Не Диалог.Выбрать() Тогда
		Возврат;
	КонецЕсли;

	Попытка  		
		СоздатьЗаписьФайла(Диалог.ПолноеИмяФайла, Диалог.Каталог); 		
		Элементы.СписокФайлов.Обновить();
	Исключение
		Сообщить("" + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	СписокФайлов.Отбор.Элементы.Очистить();
	ЭлементОтбора = СписокФайлов.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
	
КонецПроцедуры

&НаСервере
Процедура РасчетнаяТаблицаСтатьяБюджетаПриИзмененииНаСервере()
	
	РассчитатьГодовойПлан();	
	РассчитатьОтклонение();	
		
КонецПроцедуры

&НаКлиенте
Процедура РасчетнаяТаблицаСтатьяБюджетаПриИзменении(Элемент)   
	ТекСтрока = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	ТекСтрока.КодСтрокиБюджета = ТекСтрока.СтатьяБюджета.КодСтрокиБюджета;

	РасчетнаяТаблицаСтатьяБюджетаПриИзмененииНаСервере();
КонецПроцедуры

Процедура РассчитатьГодовойПлан() Экспорт
	
	ПериодПланирования = Объект.Дата;
	
	//План на год
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	Запрос.УстановитьПараметр("ФормируемыйБюджет", Объект.ФормируемыйБюджет);
	Запрос.УстановитьПараметр("НачалоПериода",НачалоГода(ПериодПланирования));
	Запрос.УстановитьПараметр("КонецПериода",КонецГода(ПериодПланирования));
	Запрос.УстановитьПараметр("Статус",Перечисления.СостоянияОбъектов.Утвержден);
		
	Запрос.Текст =
	"ВЫБРАТЬ
	|	б_БюджетОбороты.СтатьяБюджета,
	|	б_БюджетОбороты.СуммаОборот
	|ИЗ
	|	РегистрНакопления.б_Бюджет.Обороты(
	|			&Началопериода,
	|			&Конецпериода,
	|			,
	|			Организация = &Организация
	|				И Бюджет = &ФормируемыйБюджет
	|				И Статус = &Статус) КАК б_БюджетОбороты
	|";
	
	тзПлан = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТЧ ИЗ Объект.РасчетнаяТаблица Цикл
		Если СтрокаТЧ.СтатьяБюджета.ЭтоГруппа тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТЧ.ГодовойПлан =  0;
		
		СтрокаТЗ 				= тзПлан.Найти(СтрокаТЧ.СтатьяБюджета, "СтатьяБюджета");
		
		СтрокаТЧ.ГодовойПлан = ?(СтрокаТЗ = НЕОПРЕДЕЛЕНО,0,СтрокаТЗ.СуммаОборот);
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура РассчитатьОтклонение() Экспорт
	
	мСубконтоДоходы = Новый Массив;
	мСубконтоДоходы.Добавить(ПланыВидовХарактеристик.ВидыСубконтоТиповые.Доходы);
	
	мСубконтоТипыОпераций = Новый Массив;
	мСубконтоТипыОпераций.Добавить(ПланыВидовХарактеристик.ВидыСубконтоТиповые.ТипыОпераций);
	
	мСубконтоСтатьиЗатрат = Новый Массив;
	мСубконтоСтатьиЗатрат.Добавить(ПланыВидовХарактеристик.ВидыСубконтоТиповые.СтатьиЗатрат);
	
	мСубконтоОС = Новый Массив;
	мСубконтоОС.Добавить(ПланыВидовХарактеристик.ВидыСубконтоТиповые.ОсновныеСредства);
	
	мСубконтоНМА = Новый Массив;
	мСубконтоНМА.Добавить(ПланыВидовХарактеристик.ВидыСубконтоТиповые.НематериальныеАктивы);
	
	мСписокСчетовПоставщиков = Новый Массив;
	мСписокСчетовПоставщиков.Добавить(ПланыСчетов.Типовой.КраткосрочнаяКредиторскаяЗадолженность);
	
	НачалоПериода = НачалоДня(НачалоГода(Объект.Дата));
	КонецПериода  = КонецМесяца(ДобавитьМесяц(Объект.Дата,-1));
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	Запрос.УстановитьПараметр("мСписокСчетовПоставщиков", мСписокСчетовПоставщиков);
	Запрос.УстановитьПараметр("мСубконтоОС", мСубконтоОС);
	Запрос.УстановитьПараметр("мСубконтоНМА", мСубконтоНМА);
	Запрос.УстановитьПараметр("мСубконтоСтатьиЗатрат", мСубконтоСтатьиЗатрат);
	Запрос.УстановитьПараметр("мСубконтоДоходы", мСубконтоДоходы);
	Запрос.УстановитьПараметр("мСубконтоТипыОпераций", мСубконтоТипыОпераций);
	Запрос.УстановитьПараметр("ФормируемыйБюджет", Объект.ФормируемыйБюджет);
	Запрос.УстановитьПараметр("НачалоПериода",НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",КонецПериода);
	Запрос.УстановитьПараметр("Статус",Перечисления.СостоянияОбъектов.Утвержден);
		
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	ОборотПоБУ.СтатьяБюджета КАК СтатьяБюджета,
	|	ОборотПоБУ.Организация КАК Организация,
	|	ОборотПоБУ.Сумма КАК Сумма,
	|	ОборотПоБУ.Регистратор КАК Регистратор,
	|	ОборотПоБУ.ПериодМесяц КАК ПериодМесяц,
	|	ОборотПоБУ.ПериодКвартал КАК ПериодКвартал
	|ПОМЕСТИТЬ ФактическийОборот
	|ИЗ
	|	(ВЫБРАТЬ
	|		б_СоответствияСтатейБюджетаСчетамБУ.СтатьяБюджета КАК СтатьяБюджета,
	|		ЕСТЬNULL(ТиповойОбороты.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Организация,
	|		ВЫБОР
	|			КОГДА б_СоответствияСтатейБюджетаСчетамБУ.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|				ТОГДА ЕСТЬNULL(ТиповойОбороты.СуммаОборотДт, 0) * б_СоответствияСтатейБюджетаСчетамБУ.ПризнакСуммы
	|			ИНАЧЕ ЕСТЬNULL(ТиповойОбороты.СуммаОборотКт, 0) * б_СоответствияСтатейБюджетаСчетамБУ.ПризнакСуммы
	|		КОНЕЦ КАК Сумма,
	|		ТиповойОбороты.Регистратор КАК Регистратор,
	|		ТиповойОбороты.ПериодМесяц КАК ПериодМесяц,
	|		ТиповойОбороты.ПериодКвартал КАК ПериодКвартал
	|	ИЗ
	|		РегистрСведений.б_СоответствияСтатейБюджетаСчетамБУ КАК б_СоответствияСтатейБюджетаСчетамБУ
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Типовой.Обороты(
	|					&НачалоПериода,
	|					&КонецПериода,
	|					Авто,
	|					Счет В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							СоответствияСтатейБюджетаСчетамБУ.Счет
	|						ИЗ
	|							РегистрСведений.б_СоответствияСтатейБюджетаСчетамБУ КАК СоответствияСтатейБюджетаСчетамБУ),
	|					,
	|					,
	|					,
	|					) КАК ТиповойОбороты
	|			ПО (ТиповойОбороты.Счет = б_СоответствияСтатейБюджетаСчетамБУ.Счет)
	|	ГДЕ
	|		б_СоответствияСтатейБюджетаСчетамБУ.СтатьяБюджета.Владелец = &ФормируемыйБюджет
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		б_СоответствияСтатейБюджетаДоходамБУ.СтатьяБюджета,
	|		ЕСТЬNULL(ТиповойОбороты.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)),
	|		ВЫБОР
	|			КОГДА б_СоответствияСтатейБюджетаДоходамБУ.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|				ТОГДА ЕСТЬNULL(ТиповойОбороты.СуммаОборотДт, 0) * б_СоответствияСтатейБюджетаДоходамБУ.ПризнакСуммы
	|			ИНАЧЕ ЕСТЬNULL(ТиповойОбороты.СуммаОборотКт, 0) * б_СоответствияСтатейБюджетаДоходамБУ.ПризнакСуммы
	|		КОНЕЦ,
	|		ТиповойОбороты.Регистратор,
	|		ТиповойОбороты.ПериодМесяц,
	|		ТиповойОбороты.ПериодКвартал
	|	ИЗ
	|		РегистрСведений.б_СоответствияСтатейБюджетаДоходамБУ КАК б_СоответствияСтатейБюджетаДоходамБУ
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Типовой.Обороты(
	|					&НачалоПериода,
	|					&КонецПериода,
	|					Авто,
	|					Счет В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							СоответствияСтатейБюджетаДоходамБУ.Счет
	|						ИЗ
	|							РегистрСведений.б_СоответствияСтатейБюджетаДоходамБУ КАК СоответствияСтатейБюджетаДоходамБУ),
	|					&мСубконтоДоходы,
	|					,
	|					,
	|					) КАК ТиповойОбороты
	|			ПО (ТиповойОбороты.Счет = б_СоответствияСтатейБюджетаДоходамБУ.Счет)
	|				И (ТиповойОбороты.Субконто1 = б_СоответствияСтатейБюджетаДоходамБУ.Доход)
	|	ГДЕ
	|		б_СоответствияСтатейБюджетаДоходамБУ.СтатьяБюджета.Владелец = &ФормируемыйБюджет
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		б_СоответствияСтатейБюджетаТипамОперацийБУ.СтатьяБюджета,
	|		ЕСТЬNULL(ТиповойОбороты.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)),
	|		ВЫБОР
	|			КОГДА б_СоответствияСтатейБюджетаТипамОперацийБУ.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|				ТОГДА ЕСТЬNULL(ТиповойОбороты.СуммаОборотДт, 0) * б_СоответствияСтатейБюджетаТипамОперацийБУ.ПризнакСуммы
	|			ИНАЧЕ ЕСТЬNULL(ТиповойОбороты.СуммаОборотКт, 0) * б_СоответствияСтатейБюджетаТипамОперацийБУ.ПризнакСуммы
	|		КОНЕЦ,
	|		ТиповойОбороты.Регистратор,
	|		ТиповойОбороты.ПериодМесяц,
	|		ТиповойОбороты.ПериодКвартал
	|	ИЗ
	|		РегистрСведений.б_СоответствияСтатейБюджетаТипамОперацийБУ КАК б_СоответствияСтатейБюджетаТипамОперацийБУ
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Типовой.Обороты(
	|					&НачалоПериода,
	|					&КонецПериода,
	|					Авто,
	|					Счет В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							СоответствияСтатейБюджетаТипамОперацийБУ.Счет
	|						ИЗ
	|							РегистрСведений.б_СоответствияСтатейБюджетаТипамОперацийБУ КАК СоответствияСтатейБюджетаТипамОперацийБУ),
	|					&мСубконтоТипыОпераций,
	|					,
	|					,
	|					) КАК ТиповойОбороты
	|			ПО (ТиповойОбороты.Счет = б_СоответствияСтатейБюджетаТипамОперацийБУ.Счет)
	|				И (ТиповойОбороты.Субконто1 = б_СоответствияСтатейБюджетаТипамОперацийБУ.ТипОперации)
	|	ГДЕ
	|		б_СоответствияСтатейБюджетаТипамОперацийБУ.СтатьяБюджета.Владелец = &ФормируемыйБюджет
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		б_СоответствияСтатейБюджетаСтатьямЗатратБУ.СтатьяБюджета,
	|		ЕСТЬNULL(ТиповойОбороты.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)),
	|		ВЫБОР
	|			КОГДА б_СоответствияСтатейБюджетаСтатьямЗатратБУ.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|				ТОГДА ЕСТЬNULL(ТиповойОбороты.СуммаОборотДт, 0) * б_СоответствияСтатейБюджетаСтатьямЗатратБУ.ПризнакСуммы
	|			ИНАЧЕ ЕСТЬNULL(ТиповойОбороты.СуммаОборотКт, 0) * б_СоответствияСтатейБюджетаСтатьямЗатратБУ.ПризнакСуммы
	|		КОНЕЦ,
	|		ТиповойОбороты.Регистратор,
	|		ТиповойОбороты.ПериодМесяц,
	|		ТиповойОбороты.ПериодКвартал
	|	ИЗ
	|		РегистрСведений.б_СоответствияСтатейБюджетаСтатьямЗатратБУ КАК б_СоответствияСтатейБюджетаСтатьямЗатратБУ
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Типовой.Обороты(
	|					&НачалоПериода,
	|					&КонецПериода,
	|					Авто,
	|					Счет В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							СоответствияСтатейБюджетаСтатьямЗатратБУ.Счет
	|						ИЗ
	|							РегистрСведений.б_СоответствияСтатейБюджетаСтатьямЗатратБУ КАК СоответствияСтатейБюджетаСтатьямЗатратБУ),
	|					&мСубконтоСтатьиЗатрат,
	|					,
	|					,
	|					) КАК ТиповойОбороты
	|			ПО (ТиповойОбороты.Счет = б_СоответствияСтатейБюджетаСтатьямЗатратБУ.Счет)
	|				И (ТиповойОбороты.Субконто1 = б_СоответствияСтатейБюджетаСтатьямЗатратБУ.СтатьяЗатрат)
	|	ГДЕ
	|		б_СоответствияСтатейБюджетаСтатьямЗатратБУ.СтатьяБюджета.Владелец = &ФормируемыйБюджет
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		б_СоответствияСтатейБюджетаГруппамОСБУ.СтатьяБюджета,
	|		ЕСТЬNULL(ТиповойОбороты.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)),
	|		ЕСТЬNULL(ТиповойОбороты.СуммаОборотДт, 0) * б_СоответствияСтатейБюджетаГруппамОСБУ.ПризнакСуммы,
	|		ТиповойОбороты.Регистратор,
	|		ТиповойОбороты.ПериодМесяц,
	|		ТиповойОбороты.ПериодКвартал
	|	ИЗ
	|		РегистрСведений.б_СоответствияСтатейБюджетаГруппамОСБУ КАК б_СоответствияСтатейБюджетаГруппамОСБУ
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Типовой.Обороты(
	|					&НачалоПериода,
	|					&КонецПериода,
	|					Авто,
	|					Счет В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							СоответствияСтатейБюджетаГруппамОСБУ.Счет
	|						ИЗ
	|							РегистрСведений.б_СоответствияСтатейБюджетаГруппамОСБУ КАК СоответствияСтатейБюджетаГруппамОСБУ),
	|					&мСубконтоОС,
	|					,
	|					КорСчет В ИЕРАРХИИ (&мСписокСчетовПоставщиков),
	|					) КАК ТиповойОбороты
	|			ПО (ТиповойОбороты.Счет = б_СоответствияСтатейБюджетаГруппамОСБУ.Счет)
	|				И (ТиповойОбороты.Субконто1.ГруппаОС = б_СоответствияСтатейБюджетаГруппамОСБУ.ГруппаОС)
	|	ГДЕ
	|		б_СоответствияСтатейБюджетаГруппамОСБУ.СтатьяБюджета.Владелец = &ФормируемыйБюджет
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		б_СоответствияСтатейБюджетаВидамНМАБУ.СтатьяБюджета,
	|		ЕСТЬNULL(ТиповойОбороты.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)),
	|		ЕСТЬNULL(ТиповойОбороты.СуммаОборотДт, 0) * б_СоответствияСтатейБюджетаВидамНМАБУ.ПризнакСуммы,
	|		ТиповойОбороты.Регистратор,
	|		ТиповойОбороты.ПериодМесяц,
	|		ТиповойОбороты.ПериодКвартал
	|	ИЗ
	|		РегистрСведений.б_СоответствияСтатейБюджетаВидамНМАБУ КАК б_СоответствияСтатейБюджетаВидамНМАБУ
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Типовой.Обороты(
	|					&НачалоПериода,
	|					&КонецПериода,
	|					Авто,
	|					Счет В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							СоответствияСтатейБюджетаВидамНМАБУ.Счет
	|						ИЗ
	|							РегистрСведений.б_СоответствияСтатейБюджетаВидамНМАБУ КАК СоответствияСтатейБюджетаВидамНМАБУ),
	|					&мСубконтоНМА,
	|					,
	|					КорСчет В ИЕРАРХИИ (&мСписокСчетовПоставщиков),
	|					) КАК ТиповойОбороты
	|			ПО (ТиповойОбороты.Счет = б_СоответствияСтатейБюджетаВидамНМАБУ.Счет)
	|				И (ТиповойОбороты.Субконто1.ВидНМА = б_СоответствияСтатейБюджетаВидамНМАБУ.ВидНМА)
	|	ГДЕ
	|		б_СоответствияСтатейБюджетаВидамНМАБУ.СтатьяБюджета.Владелец = &ФормируемыйБюджет) КАК ОборотПоБУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОборотыБУ.Организация КАК Организация,
	|	СУММА(ОборотыБУ.Сумма) КАК СуммаФакт,
	|	СУММА(ОборотыБУ.СуммаПлан) КАК СуммаПлан,
	|	ОборотыБУ.СтатьяБюджета,
	|	СУММА(ОборотыБУ.СуммаПлан - ОборотыБУ.Сумма) КАК Отклонение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ФактическийОборотБУ.СтатьяБюджета КАК СтатьяБюджета,
	|		ФактическийОборотБУ.Организация КАК Организация,
	|		ФактическийОборотБУ.Сумма КАК Сумма,
	|		0 КАК СуммаПлан,
	|		ФактическийОборотБУ.Регистратор КАК Регистратор,
	|		ФактическийОборотБУ.ПериодМесяц КАК ПериодМесяц,
	|		ФактическийОборотБУ.ПериодКвартал КАК ПериодКвартал
	|	ИЗ
	|		ФактическийОборот КАК ФактическийОборотБУ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		б_БюджетОбороты.СтатьяБюджета,
	|		б_БюджетОбороты.Организация,
	|		0,
	|		б_БюджетОбороты.СуммаОборот,
	|		б_БюджетОбороты.Регистратор,
	|		б_БюджетОбороты.ПериодМесяц,
	|		б_БюджетОбороты.ПериодКвартал
	|	ИЗ
	|		РегистрНакопления.б_Бюджет.Обороты(
	|				&НачалоПериода,
	|				&КонецПериода,
	|				Авто,
	|				Бюджет = &ФормируемыйБюджет
	|					И Статус = &Статус) КАК б_БюджетОбороты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗависимостиСтатейБюджета.ЗависимаяСтатьяБюджета,
	|		ЕСТЬNULL(ФактическийОборотПоБУ.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)),
	|		ЕСТЬNULL(ФактическийОборотПоБУ.Сумма, 0) * ЗависимостиСтатейБюджета.Коэффициент,
	|		0,
	|		ЕСТЬNULL(ФактическийОборотПоБУ.Регистратор, NULL),
	|		ЕСТЬNULL(ФактическийОборотПоБУ.ПериодМесяц, NULL),
	|		ЕСТЬNULL(ФактическийОборотПоБУ.ПериодКвартал, NULL)
	|	ИЗ
	|		РегистрСведений.ЗависимостиСтатейБюджета КАК ЗависимостиСтатейБюджета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ФактическийОборот КАК ФактическийОборотПоБУ
	|			ПО ЗависимостиСтатейБюджета.ВлияющаяСтатьяБюджета = ФактическийОборотПоБУ.СтатьяБюджета
	|	ГДЕ
	|		ЗависимостиСтатейБюджета.ЗависимыйБюджет = &ФормируемыйБюджет) КАК ОборотыБУ
	|ГДЕ
	|	ОборотыБУ.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	ОборотыБУ.СтатьяБюджета,
	|	ОборотыБУ.Организация";
	
	тзОтклонение = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТЧ ИЗ Объект.РасчетнаяТаблица Цикл
		Если СтрокаТЧ.СтатьяБюджета.ЭтоГруппа тогда
			Продолжить;
		КонецЕсли;
		
		
		СтрокаТЧ.Отклонение = 0;
		
		СтрокаТЗОтклонение	 	= тзОтклонение.Найти(СтрокаТЧ.СтатьяБюджета, "СтатьяБюджета");
		
		СтрокаТЧ.ОстатокПланаСУчетомФакта = ?(СтрокаТЗОтклонение = НЕОПРЕДЕЛЕНО,СтрокаТЧ.ГодовойПлан,СтрокаТЧ.ГодовойПлан - СтрокаТЗОтклонение.СуммаФакт);
		СтрокаТЧ.ФактПредыдущегоПериода = ?(СтрокаТЗОтклонение = НЕОПРЕДЕЛЕНО,СтрокаТЧ.ГодовойПлан,СтрокаТЗОтклонение.СуммаФакт);

		
	
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//	"ВЫБРАТЬ
		//	|	б_ЗаявкаНаФинансированиеРасчетнаяТаблица.СтатьяБюджета,
		//	|	СУММА(б_ЗаявкаНаФинансированиеРасчетнаяТаблица.СуммаППИБезНдс) КАК СуммаППИБезНдс
		//	|ИЗ
		//	|	Документ.б_ЗаявкаНаФинансирование.РасчетнаяТаблица КАК б_ЗаявкаНаФинансированиеРасчетнаяТаблица
		//	|ГДЕ
		//	|	б_ЗаявкаНаФинансированиеРасчетнаяТаблица.СтатьяБюджета = &СтатьяБюджета
		//	|	И б_ЗаявкаНаФинансированиеРасчетнаяТаблица.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		//	|	И б_ЗаявкаНаФинансированиеРасчетнаяТаблица.ППИ <> ЗНАЧЕНИЕ(Документ.ПлатежноеПоручениеИсходящее.ПустаяСсылка)
		//	|	И б_ЗаявкаНаФинансированиеРасчетнаяТаблица.Ссылка <> &Ссылка
		//	|	И б_ЗаявкаНаФинансированиеРасчетнаяТаблица.Ссылка.Организация = &Организация
		//	|
		//	|СГРУППИРОВАТЬ ПО
		//	|	б_ЗаявкаНаФинансированиеРасчетнаяТаблица.СтатьяБюджета";
		//
		//Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
		//Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
		//Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		//Запрос.УстановитьПараметр("СтатьяБюджета", СтрокаТЧ.СтатьяБюджета);
		//Запрос.УстановитьПараметр("Организация",Объект.Организация);

		//РезультатЗапроса = Запрос.Выполнить();
		//
		//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		//
		//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//	
		//	НеРазнесенныеСуммы = ВыборкаДетальныеЗаписи.СуммаППИБезНдс - СтрокаТЗОтклонение.СуммаФакт;
		//	СтрокаТЧ.СуммыПредыдущихПлатежей = ?(НеРазнесенныеСуммы < 0,0,НеРазнесенныеСуммы);
		//КонецЦикла;
		
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетнаяТаблицаДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекСтрока = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Владелец, Организация", ТекСтрока.Контрагент, Объект.Организация));
		
	ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора", ПараметрыФормы, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура РасчетнаяТаблицаСтатьяБюджетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Владелец", Объект.ФормируемыйБюджет));
		
	ОткрытьФорму("Справочник.фин_СтатьиБюджета.ФормаВыбора", ПараметрыФормы, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура РасчетнаяТаблицаДокументПоступленияПриИзменении(Элемент)
	
	ТекСтрока = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	ТекСтрока.Контрагент = ТекСтрока.ДокументПоступления.Контрагент;
	ТекСтрока.Договор = ТекСтрока.ДокументПоступления.ДоговорКонтрагента;
	ТекСтрока.ВалютаДокумента = ТекСтрока.ДокументПоступления.ДоговорКонтрагента.ВалютаВзаиморасчетов;
	ТекСтрока.СуммаПоЗаявке = ТекСтрока.ДокументПоступления.СуммаДокумента;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетнаяТаблицаДоговорПриИзменении(Элемент)
	
	ТекСтрока = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	ТекСтрока.ВалютаДокумента = ТекСтрока.Договор.ВалютаВзаиморасчетов;
	ТекСтрока.СуммаДоговора = ТекСтрока.Договор.СуммаДоговора;

	
	Счета = Новый СписокЗначений;
	Счета.Добавить(ПланыСчетов.Типовой.КраткосрочныеАвансыВыданные);
	Счета.Добавить(ПланыСчетов.Типовой.КраткосрочнаяЗадолженностьПоставщикамИПодрядчикам);
	Счета.Добавить(ПланыСчетов.Типовой.КраткосрочнаяЗадолженностьПоАренде);
	Счета.Добавить(ПланыСчетов.Типовой.ПрочиеАвансывыданныеСоб);
	
	КорСчета = Новый СписокЗначений;
	КорСчета.Добавить(ПланыСчетов.Типовой.ДенежныеСредстваНаТекущихБанковскихСчетах);
	КорСчета.Добавить(ПланыСчетов.Типовой.КраткосрочнаяДебиторскаяЗадолженностьПредставительств);

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТиповойОбороты.СуммаОборот,
		|	ТиповойОбороты.Субконто1,
		|	ТиповойОбороты.Субконто2,
		|	ЕСТЬNULL(дог_ДоговорыИДополнительныеСоглашенияСрезПоследних.ОбщаяСуммаДоговора, ТиповойОбороты.Субконто2.СуммаДоговора) КАК СуммаДоговора
		|ИЗ
		|	РегистрСведений.дог_ДоговорыИДополнительныеСоглашения.СрезПоследних(&КонецПериода, ) КАК дог_ДоговорыИДополнительныеСоглашенияСрезПоследних
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Типовой.Обороты(&НачалоПериода, &КонецПериода, , Счет В ИЕРАРХИИ (&Счета), , Организация = &Организация, КорСчет В ИЕРАРХИИ (&КорСчета), ) КАК ТиповойОбороты
		|		ПО дог_ДоговорыИДополнительныеСоглашенияСрезПоследних.Договор = ТиповойОбороты.Субконто2
		|ГДЕ
		|	ТиповойОбороты.Субконто1 = &Контрагент
		|	И ТиповойОбороты.Субконто2 = &Договор";
	
	Запрос.УстановитьПараметр("КонецПериода", Объект.Дата);
	Запрос.УстановитьПараметр("КорСчета", КорСчета);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(Объект.Дата));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Счета", Счета);
	Запрос.УстановитьПараметр("Контрагент", ТекСтрока.Контрагент);
	Запрос.УстановитьПараметр("Договор", ТекСтрока.Договор);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ТекСтрока.ОплаченоПоДоговору = Выборка.СуммаОборот;
		ТекСтрока.СуммаДоговора = Выборка.СуммаДоговора;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура РасчетнаяТаблицаДокументПоступленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекСтрока = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Контрагент, ДоговорКонтрагента", ТекСтрока.Контрагент, ТекСтрока.Договор));
		
	ОткрытьФорму("Документ.ПоступлениеТоваровУслуг.ФормаВыбора", ПараметрыФормы, Элемент);

КонецПроцедуры

&НаСервере
Процедура СоздатьППИНаСервере(Массив)
	 Для Каждого СтрокаЗаписи из Объект.РасчетнаяТаблица Цикл
		ДобДокумент = Документы.ПлатежноеПоручениеИсходящее.СоздатьДокумент();
		ДобДокумент.Контрагент = СтрокаЗаписи.Контрагент;
		ДобДокумент.ДокументОснование = Объект.Ссылка;
		ДобДокумент.ВидОперации = Перечисления.ВидыОперацийППИсходящее.ОплатаПоставщику;
		ДобДокумент.Дата = ТекущаяДата();
		ДобДокумент.ТипОперации = СтрокаЗаписи.ТипОперации;
		ДобДокумент.СтатьяДвиженияДенежныхСредств = СтрокаЗаписи.СтатьяДвиженияДенежныхСредств;
		ДобДокумент.ВидУчетаНУ = Справочники.ВидыУчетаНУ.НУ;
		ДобДокумент.СчетУчетаРасчетовСКонтрагентомБУ = ПланыСчетов.Типовой.КраткосрочнаяЗадолженностьПоставщикамИПодрядчикам;
		//ДобДокумент.СчетУчетаРасчетовСоСтруктурнымПодразделением = ПланыСчетов.Типовой.ДенежныеСредстваНаТекущихБанковскихСчетахСоб;
		ДобДокумент.СчетБанк = ПланыСчетов.Типовой.ДенежныеСредстваНаТекущихБанковскихСчетахСоб;
		ДобДокумент.СуммаДокумента = СтрокаЗаписи.СуммаПоЗаявке;
		ДобДокумент.СчетОрганизации = Справочники.БанковскиеСчета.НайтиПоКоду("ПР0005143");
		ДобДокумент.СчетКонтрагента = СтрокаЗаписи.СчетКонтрагента; 
		//ДобДокумент.ВидНалога = Справочники.НалогиСборыОтчисления.	
		ДобДокумент.ВалютаДокумента = СтрокаЗаписи.ВалютаДокумента;
		ДобДокумент.Организация = Объект.Организация;
		ДобСтрока = ДобДокумент.РасшифровкаПлатежа.Добавить();
		ДобСтрока.ДоговорКонтрагента = СтрокаЗаписи.Договор;
		ДобСтрока.СуммаПлатежа = СтрокаЗаписи.СуммаПоЗаявке;
		ДобСтрока.СчетУчетаРасчетовСКонтрагентомБУ = ПланыСчетов.Типовой.КраткосрочнаяЗадолженностьПоставщикамИПодрядчикам;
		ДобСтрока.СтатьяДвиженияДенежныхСредств = СтрокаЗаписи.СтатьяДвиженияДенежныхСредств;
		ДобСтрока.ИсточникФинансирования = Справочники.ИсточникиФинансирования.СобственныеСредства;
		ДобСтрока.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоКоду("000000001");
		ДобДокумент.ОтражатьВБухгалтерскомУчете = Истина;
		ДобДокумент.ОтраженоВОперУчете = Истина;
		ДобДокумент.УчитыватьКПН = Истина;
		ДобДокумент.РННПлательщика = Объект.Организация.РНН;
		ДобДокумент.РННПолучателя = СтрокаЗаписи.Контрагент.РНН;
		ДобДокумент.ДатаВалютирования = ДобДокумент.Дата;
		ДобДокумент.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		ДобДокумент.Представительство = Справочники.Представительства.НайтиПоКоду("000000008");
		ДобДокумент.ТекстПлательщика = Строка(Объект.Организация);
		ДобДокумент.ТекстПолучателя = Строка(СтрокаЗаписи.Контрагент);
		ДобДокумент.НазначениеПлатежа = Строка(Объект.Назначение)+" на основании договора "+СтрокаЗаписи.Договор+", согласно ЭСФ №"+СтрокаЗаписи.ЭСФ.Номер+" от "+Формат(СтрокаЗаписи.ЭСФ.Дата, "ДФ=dd.MM.yyyy")+"";
		ДобДокумент.Записать(РежимЗаписиДокумента.Запись);
		Массив.Добавить(ДобДокумент.Ссылка);
	КонецЦикла;

КонецПроцедуры

Функция СоздатьОдиночныйППИ(НомерСтроки)
	
	Для Каждого СтрокаЗаписи Из Объект.РасчетнаяТаблица Цикл
		Если СтрокаЗаписи.НомерСтроки = НомерСтроки Тогда
			ДобДокумент = Документы.ПлатежноеПоручениеИсходящее.СоздатьДокумент();
			ДобДокумент.Контрагент = СтрокаЗаписи.Контрагент;
			ДобДокумент.ДокументОснование = Объект.Ссылка;
			ДобДокумент.ВидОперации = Перечисления.ВидыОперацийППИсходящее.ОплатаПоставщику;
			ДобДокумент.Дата = ТекущаяДата();
			ДобДокумент.ТипОперации = СтрокаЗаписи.ТипОперации;
			ДобДокумент.СтатьяДвиженияДенежныхСредств = СтрокаЗаписи.СтатьяДвиженияДенежныхСредств;
			ДобДокумент.ВидУчетаНУ = Справочники.ВидыУчетаНУ.НУ;
			ДобДокумент.СчетУчетаРасчетовСКонтрагентомБУ = ПланыСчетов.Типовой.КраткосрочнаяЗадолженностьПоставщикамИПодрядчикам;
			//ДобДокумент.СчетУчетаРасчетовСоСтруктурнымПодразделением = ПланыСчетов.Типовой.ДенежныеСредстваНаТекущихБанковскихСчетахСоб;
			ДобДокумент.СчетБанк = ПланыСчетов.Типовой.ДенежныеСредстваНаТекущихБанковскихСчетахСоб;
			ДобДокумент.СуммаДокумента = СтрокаЗаписи.СуммаПоЗаявке;
			ДобДокумент.СчетОрганизации = Справочники.БанковскиеСчета.НайтиПоКоду("ПР0005143");
			ДобДокумент.СчетКонтрагента = СтрокаЗаписи.СчетКонтрагента; 
			//ДобДокумент.ВидНалога = Справочники.НалогиСборыОтчисления.	
			ДобДокумент.ВалютаДокумента = СтрокаЗаписи.ВалютаДокумента;
			ДобДокумент.Организация = Объект.Организация;
			ДобСтрока = ДобДокумент.РасшифровкаПлатежа.Добавить();
			ДобСтрока.ДоговорКонтрагента = СтрокаЗаписи.Договор;
			ДобСтрока.СуммаПлатежа = СтрокаЗаписи.СуммаПоЗаявке;
			ДобСтрока.СчетУчетаРасчетовСКонтрагентомБУ = ПланыСчетов.Типовой.КраткосрочнаяЗадолженностьПоставщикамИПодрядчикам;
			ДобСтрока.СтатьяДвиженияДенежныхСредств = СтрокаЗаписи.СтатьяДвиженияДенежныхСредств;
			ДобСтрока.ИсточникФинансирования = Справочники.ИсточникиФинансирования.СобственныеСредства;
			ДобСтрока.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоКоду("000000001");
			ДобДокумент.ОтражатьВБухгалтерскомУчете = Истина;
			ДобДокумент.ОтраженоВОперУчете = Истина;
			ДобДокумент.УчитыватьКПН = Истина;
			ДобДокумент.РННПлательщика = Объект.Организация.РНН;
			ДобДокумент.РННПолучателя = СтрокаЗаписи.Контрагент.РНН;
			ДобДокумент.ДатаВалютирования = ДобДокумент.Дата;
			ДобДокумент.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			ДобДокумент.Представительство = Справочники.Представительства.НайтиПоКоду("000000008");
			ДобДокумент.ТекстПлательщика = Строка(Объект.Организация);
			ДобДокумент.ТекстПолучателя = Строка(СтрокаЗаписи.Контрагент);
			ДобДокумент.НазначениеПлатежа = Строка(Объект.Назначение)+" на основании договора "+СтрокаЗаписи.Договор+", согласно ЭСФ №"+СтрокаЗаписи.ЭСФ.Номер+" от "+Формат(СтрокаЗаписи.ЭСФ.Дата, "ДФ=dd.MM.yyyy")+"";
			ДобДокумент.Записать(РежимЗаписиДокумента.Запись);
			//Массив.Добавить(ДобДокумент.Ссылка);
			
		Иначе
			Продолжить;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДобДокумент.Ссылка;
КонецФункции

&НаКлиенте
Процедура СоздатьППИ(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНетОтмена;
	Ответ = Вопрос("Создать по выбранной строке?", Режим, 0);
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОткрытьЗначение(СоздатьОдиночныйППИ(Элементы.РасчетнаяТаблица.ТекущиеДанные.НомерСтроки));
		//Строка = Элементы.РасчетнаяТаблица.ТекущиеДанные;
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		
		МассивДокументов = Новый Массив;
		СоздатьППИНаСервере(МассивДокументов);
		Для Каждого СтрокаДок Из МассивДокументов Цикл
			ОткрытьЗначение(СтрокаДок);
		КонецЦикла;
	Иначе
		Возврат;
	КонецЕсли;

	
КонецПроцедуры
